---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementIsCurveDrivenFilter
source: html/23871a91-8931-ebdc-c6e4-e08def310a67.htm
---
# ElementIsCurveDrivenFilter Methods

Applies the filter to a given element.